Test/TestResult/1000/WasmEdge1000JIT.txt
hey -n 1000 http://0.0.0.0:8080

Summary:
  Total:        1.6571 secs
  Slowest:      0.1121 secs
  Fastest:      0.0308 secs
  Average:      0.0810 secs
  Requests/sec: 603.4697

  Total data:   6000 bytes
  Size/request: 6 bytes

Response time histogram:
  0.031 [1]     |
  0.039 [3]     |
  0.047 [7]     |■
  0.055 [3]     |
  0.063 [7]     |■
  0.071 [6]     |■
  0.080 [348]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.088 [467]   |■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■■
  0.096 [117]   |■■■■■■■■■■
  0.104 [35]    |■■■
  0.112 [6]     |■


Latency distribution:
  10% in 0.0744 secs
  25% in 0.0758 secs
  50% in 0.0817 secs
  75% in 0.0837 secs
  90% in 0.0907 secs
  95% in 0.0933 secs
  99% in 0.0969 secs

Details (average, fastest, slowest):
  DNS+dialup:   0.0000 secs, 0.0308 secs, 0.1121 secs
  DNS-lookup:   0.0000 secs, 0.0000 secs, 0.0000 secs
  req write:    0.0000 secs, 0.0000 secs, 0.0012 secs
  resp wait:    0.0808 secs, 0.0302 secs, 0.1114 secs
  resp read:    0.0001 secs, 0.0000 secs, 0.0006 secs

Status code distribution:
  [200] 1000 responses